STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_HealthThermometer/STM32_BLE/App/hts_app.c
  /* USER CODE BEGIN Service2Char1_IS_Last*/

  /* USER CODE END Service2Char1_IS_Last*/

  return;
}

__USED void HTS_Int_SendNotification(void) /* Property Notification */
{
  HTS_APP_SendInformation_t notification_on_off = Int_NOTIFICATION_OFF;
  HTS_Data_t hts_notification_data;

  hts_notification_data.p_Payload = (uint8_t*)a_HTS_UpdateCharData;
  hts_notification_data.Length = 0;

  /* USER CODE BEGIN Service2Char3_NS_1*/

  /* USER CODE END Service2Char3_NS_1*/

  if (notification_on_off != Int_NOTIFICATION_OFF && HTS_APP_Context.ConnectionHandle != 0xFFFF)
  {
    HTS_NotifyValue(HTS_INT, &hts_notification_data, HTS_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service2Char3_NS_Last*/

  /* USER CODE END Service2Char3_NS_Last*/

  return;
}

__USED void HTS_Mei_SendIndication(void) /* Property Indication */
{
  HTS_APP_SendInformation_t indication_on_off = Mei_INDICATION_OFF;
  HTS_Data_t hts_indication_data;

  hts_indication_data.p_Payload = (uint8_t*)a_HTS_UpdateCharData;
  hts_indication_data.Length = 0;

  /* USER CODE BEGIN Service2Char4_IS_1*/

  /* USER CODE END Service2Char4_IS_1*/

  if (indication_on_off != Mei_INDICATION_OFF && HTS_APP_Context.ConnectionHandle != 0xFFFF)
  {
    HTS_NotifyValue(HTS_MEI, &hts_indication_data, HTS_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service2Char4_IS_Last*/

  /* USER CODE END Service2Char4_IS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/
void HTS_APP_Measurement(void)
{
  uint32_t measurement;
  tBleStatus ret;
  HTS_Data_t msg_conf;

  uint8_t atm_value[
                    1 +         /* Flags */
                    4 +         /* MeasurementValue */
                    7 +         /* TimeStamp */
                    1           /* TemperatureType */
                    ];
  uint8_t tm_char_length;

  if((HTS_APP_Context.Int_Notification_Status == Int_NOTIFICATION_ON)&&(HTS_FirstMeasurementDone==1))
  {
    measurement = HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue;
  }
  else
  {
    HTS_FirstMeasurementDone=1;
    measurement = ((HTS_APP_Read_RTC_SSR_SS()) + 37);
  }
  HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue = measurement;
  APP_DBG_MSG("HTS_APP_Measurement: %d \n", (int)measurement);

  HTS_APP_Update_TimeStamp();

  if((APP_BLE_Get_Server_Connection_Status() == APP_BLE_CONNECTED_SERVER) &&
     (HTS_APP_Context.Temm_Indication_Status == Temm_INDICATION_ON))
  {
    if(HTS_Measurement[HTS_OldIndex].MeasurementValue > 0)
    {
      APP_DBG_MSG ("Send stored measurement %d\n", HTS_OldIndex);  
      HTS_APP_Suppress();
      HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id);
      HTS_Temm_interval = DEFAULT_HTS_MEASUREMENT_INTERVAL;
      HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id, HTS_Temm_interval);   //DEFAULT_HTS_MEASUREMENT_INTERVAL);
    }
    else
    {
      HAL_RADIO_TIMER_StopVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id);
      HTS_Temm_interval = DEFAULT_HTS_MEASUREMENT_INTERVAL*10;
      HAL_RADIO_TIMER_StartVirtualTimer(&HTS_APP_Context.TimerMeasurement_Id, HTS_Temm_interval);   //DEFAULT_HTS_MEASUREMENT_INTERVAL*10);
      /**
       * Flags update
       */
      atm_value[0] = (uint8_t)HTS_APP_Context.TemperatureMeasurementChar.Flags;

      /**
       *  Temperature Measurement Value
       */
      atm_value[1] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue);
      atm_value[2] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue >> 8);
      atm_value[3] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue >> 16);
      atm_value[4] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue >> 24);

      tm_char_length = 5;

      if (HTS_APP_Context.TemperatureMeasurementChar.Flags &  SENSOR_TIME_STAMP_PRESENT)
      {
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Year);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Year >> 8);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Month);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Day);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Hours);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Minutes);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Seconds);
        tm_char_length++;
      }

      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TemperatureType);
      tm_char_length++;

      /**
       * Update Temperature Measurement Value
       */
      msg_conf.p_Payload = atm_value;
      msg_conf.Length = tm_char_length;
      HTS_UpdateValue(HTS_TEMM, &msg_conf);
      ret = HTS_NotifyValue(HTS_TEMM, &msg_conf, HTS_APP_Context.ConnectionHandle);
      if(ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("HTS_NotifyValue fails\n");
      }
    }
  }
  else
  {
    HTS_APP_Store();
  }

  return;
}

static void HTS_APP_IntermediateTemperature(void)
{
  tBleStatus ret;
  HTS_Data_t msg_conf;
  uint8_t atm_value[
                    1 +         /* Flags */
                    4 +         /* MeasurementValue */
                    7 +         /* TimeStamp */
                    1           /* TemperatureType */
                    ];
  uint8_t tm_char_length;  

  HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue = ((HTS_APP_Read_RTC_SSR_SS()) + 37);

  if(HTS_APP_Context.Int_Notification_Status == Int_NOTIFICATION_ON)
  {
    APP_DBG_MSG("HTS_APP_IntermediateTemperature: %d \n", HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue);
    /**
     * Flags update
     */
    atm_value[0] = (uint8_t)HTS_APP_Context.IntermediateTemperatureChar.Flags;

    /**
     *  Intermediate Temperature Measurement Value
     */
    atm_value[1] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue);
    atm_value[2] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 8);
    atm_value[3] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 16);
    atm_value[4] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 24);

    tm_char_length = 5;

    if (HTS_APP_Context.IntermediateTemperatureChar.Flags &  SENSOR_TIME_STAMP_PRESENT)
    {
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Year);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Year >> 8);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Month);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Day);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Hours);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Minutes);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Seconds);
      tm_char_length++;
    }

